In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [179]:
s = pd.Series([1,3,5,np.nan,7,8,9])

In [183]:
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    7.0
5    8.0
6    9.0
dtype: float64

In [ ]:
# 將Series轉成 list
print(s.tolist())

In [158]:
dates = pd.date_range('20130101', periods=7,freq='D')

In [182]:
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [160]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=list('ABCD'))

In [144]:
df

                   A         B         C         D
2013-01-01 -1.426617 -0.154119 -0.972432 -0.330151
2013-01-02  0.163444  0.039687 -0.256255 -0.114978
2013-01-03  1.005395 -0.084187 -0.657723 -0.179944
2013-01-04  2.108844  0.673685 -0.983500 -0.921739
2013-01-05  1.500700  0.179856  1.044792 -1.470056
2013-01-06  0.587459 -0.263210  0.652330 -1.984831
2013-01-07 -0.082497 -1.695130 -0.088945 -0.349827

In [8]:
df2 = pd.DataFrame({ 'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo' })

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.876253  0.494423 -1.154706  2.134063
2013-01-02  1.428566 -1.289029  0.061972  0.243566
2013-01-03 -0.766940 -0.676397 -1.101657 -0.797881
2013-01-04 -0.047217  1.094577 -0.802162  1.479046
2013-01-05 -0.439379 -0.088270  2.289276  0.723323

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-05 -0.439379 -0.088270  2.289276  0.723323
2013-01-06 -0.300504  0.470461  0.519427  0.622797
2013-01-07 -0.552341 -0.942547  0.721599 -1.886106

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.values

array([[ 0.8762528 ,  0.49442255, -1.15470611,  2.1340632 ],
       [ 1.4285663 , -1.28902912,  0.06197241,  0.24356635],
       [-0.76694044, -0.6763969 , -1.10165675, -0.79788102],
       [-0.04721736,  1.09457677, -0.80216201,  1.47904567],
       [-0.43937869, -0.08827013,  2.28927568,  0.72332347],
       [-0.30050443,  0.47046089,  0.51942663,  0.622797  ],
       [-0.55234124, -0.94254748,  0.72159942, -1.88610642]])

In [16]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.028348 -0.133826  0.076250  0.359830
std    0.814643  0.871188  1.237261  1.353998
min   -0.766940 -1.289029 -1.154706 -1.886106
25%   -0.495860 -0.809472 -0.951909 -0.277157
50%   -0.300504 -0.088270  0.061972  0.622797
75%    0.414518  0.482442  0.620513  1.101185
max    1.428566  1.094577  2.289276  2.134063

In [17]:
df.T

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,2013-01-07 00:00:00
A,0.876253,1.428566,-0.766940,-0.047217,-0.439379,-0.300504,-0.552341
B,0.494423,-1.289029,-0.676397,1.094577,-0.088270,0.470461,-0.942547
C,-1.154706,0.061972,-1.101657,-0.802162,2.289276,0.519427,0.721599
D,2.134063,0.243566,-0.797881,1.479046,0.723323,0.622797,-1.886106

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  2.134063 -1.154706  0.494423  0.876253
2013-01-02  0.243566  0.061972 -1.289029  1.428566
2013-01-03 -0.797881 -1.101657 -0.676397 -0.766940
2013-01-04  1.479046 -0.802162  1.094577 -0.047217
2013-01-05  0.723323  2.289276 -0.088270 -0.439379
2013-01-06  0.622797  0.519427  0.470461 -0.300504
2013-01-07 -1.886106  0.721599 -0.942547 -0.552341

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  1.428566 -1.289029  0.061972  0.243566
2013-01-07 -0.552341 -0.942547  0.721599 -1.886106
2013-01-03 -0.766940 -0.676397 -1.101657 -0.797881
2013-01-05 -0.439379 -0.088270  2.289276  0.723323
2013-01-06 -0.300504  0.470461  0.519427  0.622797
2013-01-01  0.876253  0.494423 -1.154706  2.134063
2013-01-04 -0.047217  1.094577 -0.802162  1.479046

In [20]:
df['A']

2013-01-01    0.876253
2013-01-02    1.428566
2013-01-03   -0.766940
2013-01-04   -0.047217
2013-01-05   -0.439379
2013-01-06   -0.300504
2013-01-07   -0.552341
Freq: D, Name: A, dtype: float64

In [21]:
df.A

2013-01-01    0.876253
2013-01-02    1.428566
2013-01-03   -0.766940
2013-01-04   -0.047217
2013-01-05   -0.439379
2013-01-06   -0.300504
2013-01-07   -0.552341
Freq: D, Name: A, dtype: float64

# 資料切片使用loc
    可以取特定欄,而列用index name去locate

In [22]:
df

                   A         B         C         D
2013-01-01  0.876253  0.494423 -1.154706  2.134063
2013-01-02  1.428566 -1.289029  0.061972  0.243566
2013-01-03 -0.766940 -0.676397 -1.101657 -0.797881
2013-01-04 -0.047217  1.094577 -0.802162  1.479046
2013-01-05 -0.439379 -0.088270  2.289276  0.723323
2013-01-06 -0.300504  0.470461  0.519427  0.622797
2013-01-07 -0.552341 -0.942547  0.721599 -1.886106

In [23]:
#取前3列, 針對所有欄
df[0:3]

                   A         B         C         D
2013-01-01  0.876253  0.494423 -1.154706  2.134063
2013-01-02  1.428566 -1.289029  0.061972  0.243566
2013-01-03 -0.766940 -0.676397 -1.101657 -0.797881

In [24]:
#取出20130102':'20130104', 針對所有欄
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.428566 -1.289029  0.061972  0.243566
2013-01-03 -0.766940 -0.676397 -1.101657 -0.797881
2013-01-04 -0.047217  1.094577 -0.802162  1.479046

In [25]:
print(dates[0])
df.loc[dates[0]]

2013-01-01 00:00:00

A    0.876253
B    0.494423
C   -1.154706
D    2.134063
Name: 2013-01-01 00:00:00, dtype: float64

In [26]:
#利用 loc 可以撰擇部份欄
df2=df.loc[:,['A','B']]

In [27]:
df2

                   A         B
2013-01-01  0.876253  0.494423
2013-01-02  1.428566 -1.289029
2013-01-03 -0.766940 -0.676397
2013-01-04 -0.047217  1.094577
2013-01-05 -0.439379 -0.088270
2013-01-06 -0.300504  0.470461
2013-01-07 -0.552341 -0.942547

In [28]:
df

                   A         B         C         D
2013-01-01  0.876253  0.494423 -1.154706  2.134063
2013-01-02  1.428566 -1.289029  0.061972  0.243566
2013-01-03 -0.766940 -0.676397 -1.101657 -0.797881
2013-01-04 -0.047217  1.094577 -0.802162  1.479046
2013-01-05 -0.439379 -0.088270  2.289276  0.723323
2013-01-06 -0.300504  0.470461  0.519427  0.622797
2013-01-07 -0.552341 -0.942547  0.721599 -1.886106

In [100]:
df.loc['20130102':'20130104',['A','B']]
#df.loc[0:4,['A','B']]  # Error! can only use index name

                   A         B
2013-01-02  1.428566 -1.289029
2013-01-03 -0.766940 -0.676397
2013-01-04 -0.047217  1.094577

In [30]:
df.loc['20130102',['A','B']]

A    1.428566
B   -1.289029
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.loc[dates[0],'A']

0.8762528028067224

In [32]:
df.loc[:, 'D'] = [i for i in range(7)] #修改所有列的值
df

                   A         B         C  D
2013-01-01  0.876253  0.494423 -1.154706  0
2013-01-02  1.428566 -1.289029  0.061972  1
2013-01-03 -0.766940 -0.676397 -1.101657  2
2013-01-04 -0.047217  1.094577 -0.802162  3
2013-01-05 -0.439379 -0.088270  2.289276  4
2013-01-06 -0.300504  0.470461  0.519427  5
2013-01-07 -0.552341 -0.942547  0.721599  6

# 資料切片使用iloc
    使用index(row number)去選取特定列
    df.iloc[i] returns the ith row of df. i does not refer to the index label, i is a 0-based index.
    In contrast, the attribute index returns actual index labels, not numeric row-indices:

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.876253  0.494423
2013-01-02  1.428566 -1.289029
2013-01-03 -0.766940 -0.676397
2013-01-04 -0.047217  1.094577
2013-01-05 -0.439379 -0.088270
2013-01-06 -0.300504  0.470461
2013-01-07 -0.552341 -0.942547

In [34]:
print(df.loc[:,['A','B']])
print(df.iloc[0])
print(df.iloc[0:3])
print(df.iloc[0:3,1:3])

                   A         B
2013-01-01  0.876253  0.494423
2013-01-02  1.428566 -1.289029
2013-01-03 -0.766940 -0.676397
2013-01-04 -0.047217  1.094577
2013-01-05 -0.439379 -0.088270
2013-01-06 -0.300504  0.470461
2013-01-07 -0.552341 -0.942547
A    0.876253
B    0.494423
C   -1.154706
D    0.000000
Name: 2013-01-01 00:00:00, dtype: float64
                   A         B         C  D
2013-01-01  0.876253  0.494423 -1.154706  0
2013-01-02  1.428566 -1.289029  0.061972  1
2013-01-03 -0.766940 -0.676397 -1.101657  2
                   B         C
2013-01-01  0.494423 -1.154706
2013-01-02 -1.289029  0.061972
2013-01-03 -0.676397 -1.101657

# index to one cell

In [35]:
df.at[dates[2],'C']

-1.10165675148415

In [36]:
df.iloc[2,2]

-1.10165675148415

In [37]:
df.iloc[2,2]=100
df

                   A         B           C  D
2013-01-01  0.876253  0.494423   -1.154706  0
2013-01-02  1.428566 -1.289029    0.061972  1
2013-01-03 -0.766940 -0.676397  100.000000  2
2013-01-04 -0.047217  1.094577   -0.802162  3
2013-01-05 -0.439379 -0.088270    2.289276  4
2013-01-06 -0.300504  0.470461    0.519427  5
2013-01-07 -0.552341 -0.942547    0.721599  6

# 按給定條件進行查詢

In [38]:
df

                   A         B           C  D
2013-01-01  0.876253  0.494423   -1.154706  0
2013-01-02  1.428566 -1.289029    0.061972  1
2013-01-03 -0.766940 -0.676397  100.000000  2
2013-01-04 -0.047217  1.094577   -0.802162  3
2013-01-05 -0.439379 -0.088270    2.289276  4
2013-01-06 -0.300504  0.470461    0.519427  5
2013-01-07 -0.552341 -0.942547    0.721599  6

In [39]:
df[df.A>0]

                   A         B         C  D
2013-01-01  0.876253  0.494423 -1.154706  0
2013-01-02  1.428566 -1.289029  0.061972  1

In [40]:
k=df[df.A>0]
print(k.index)

DatetimeIndex(['2013-01-01', '2013-01-02'], dtype='datetime64[ns]', freq='D')

In [41]:
x=df.A>0
y=df.B<0
df[( x&y )]

                   A         B         C  D
2013-01-02  1.428566 -1.289029  0.061972  1

In [162]:
df[df.index=='2013-01-02']

                   A        B         C         D
2013-01-02  0.495231 -0.36231 -1.821214 -0.989242

In [43]:
#df[df['datetime'].between("2013-01-02","2013-01-05")]

# 刪除欄列

In [72]:
df

                   A         B           C    D
2013-01-01  0.876253  0.494423    5.000000  0.0
2013-01-02  1.428566 -1.289029    0.061972  5.0
2013-01-03 -0.766940 -0.676397  100.000000  2.0
2013-01-04 -0.047217  1.094577   -0.802162  3.0
2013-01-05 -0.439379 -0.088270    2.289276  4.0
2013-01-06 -0.300504  0.470461    0.519427  5.0
2013-01-07 -0.552341 -0.942547    0.721599  6.0

In [70]:
#刪除A,B兩欄
df.drop(['A', 'B'], axis=1)

                     C    D
2013-01-01    5.000000  0.0
2013-01-02    0.061972  5.0
2013-01-03  100.000000  2.0
2013-01-04   -0.802162  3.0
2013-01-05    2.289276  4.0
2013-01-06    0.519427  5.0
2013-01-07    0.721599  6.0

In [114]:
#刪除列by row number
#df.drop(df.index[2]) # drop a row
df.drop(df.index[:4]) # drop a range

                   A         B         C    D
2013-01-05 -0.439379 -0.088270  2.289276  4.0
2013-01-06 -0.300504  0.470461  0.519427  5.0
2013-01-07 -0.552341 -0.942547  0.721599  6.0

In [175]:
df.drop(df.index[-2])

                   A         B         C         D
2013-01-01  0.319110 -0.430784 -0.588553 -0.903382
2013-01-02  0.495231 -0.362310 -1.821214 -0.989242
2013-01-03 -1.007126 -0.731705  0.172588 -0.898034
2013-01-04 -0.739426  1.282242 -0.186688 -0.096997
2013-01-05  0.362440  0.464469  0.065918  0.704714
2013-01-07  0.057402 -1.722858 -0.262974  0.235084

In [116]:
df.drop(df.index[:-3])

                   A         B         C    D
2013-01-05 -0.439379 -0.088270  2.289276  4.0
2013-01-06 -0.300504  0.470461  0.519427  5.0
2013-01-07 -0.552341 -0.942547  0.721599  6.0

In [145]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [149]:
df

                   A         B         C         D
2013-01-01 -1.426617 -0.154119 -0.972432 -0.330151
2013-01-02  0.163444  0.039687 -0.256255 -0.114978
2013-01-03  1.005395 -0.084187 -0.657723 -0.179944
2013-01-04  2.108844  0.673685 -0.983500 -0.921739
2013-01-05  1.500700  0.179856  1.044792 -1.470056
2013-01-06  0.587459 -0.263210  0.652330 -1.984831
2013-01-07 -0.082497 -1.695130 -0.088945 -0.349827

In [122]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [123]:
df.drop(['Cochice', 'Pima'])

            name  year  reports
Santa Cruz  Tina  2013       31
Maricopa    Jake  2014        2
Yuma         Amy  2014        3

## 缺失值處理

In [45]:
df

                   A         B           C  D
2013-01-01  0.876253  0.494423   -1.154706  0
2013-01-02  1.428566 -1.289029    0.061972  1
2013-01-03 -0.766940 -0.676397  100.000000  2
2013-01-04 -0.047217  1.094577   -0.802162  3
2013-01-05 -0.439379 -0.088270    2.289276  4
2013-01-06 -0.300504  0.470461    0.519427  5
2013-01-07 -0.552341 -0.942547    0.721599  6

In [46]:
df.iloc[1,3]=np.NaN
df.iloc[0,2]=np.NaN
mask = df["C"].isnull()
print(mask)

2013-01-01     True
2013-01-02    False
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
2013-01-07    False
Freq: D, Name: C, dtype: bool

In [47]:
df

                   A         B           C    D
2013-01-01  0.876253  0.494423         NaN  0.0
2013-01-02  1.428566 -1.289029    0.061972  NaN
2013-01-03 -0.766940 -0.676397  100.000000  2.0
2013-01-04 -0.047217  1.094577   -0.802162  3.0
2013-01-05 -0.439379 -0.088270    2.289276  4.0
2013-01-06 -0.300504  0.470461    0.519427  5.0
2013-01-07 -0.552341 -0.942547    0.721599  6.0

In [48]:
pd.isnull(df)

                A      B      C      D
2013-01-01  False  False   True  False
2013-01-02  False  False  False   True
2013-01-03  False  False  False  False
2013-01-04  False  False  False  False
2013-01-05  False  False  False  False
2013-01-06  False  False  False  False
2013-01-07  False  False  False  False

In [49]:
#刪除有缺值的列
df.dropna()

                   A         B           C    D
2013-01-03 -0.766940 -0.676397  100.000000  2.0
2013-01-04 -0.047217  1.094577   -0.802162  3.0
2013-01-05 -0.439379 -0.088270    2.289276  4.0
2013-01-06 -0.300504  0.470461    0.519427  5.0
2013-01-07 -0.552341 -0.942547    0.721599  6.0

In [50]:
df['C'].fillna(5, inplace=True) #使用指定值填充缺失值
df

                   A         B           C    D
2013-01-01  0.876253  0.494423    5.000000  0.0
2013-01-02  1.428566 -1.289029    0.061972  NaN
2013-01-03 -0.766940 -0.676397  100.000000  2.0
2013-01-04 -0.047217  1.094577   -0.802162  3.0
2013-01-05 -0.439379 -0.088270    2.289276  4.0
2013-01-06 -0.300504  0.470461    0.519427  5.0
2013-01-07 -0.552341 -0.942547    0.721599  6.0

## 資料統計分析

In [51]:
df

                   A         B           C    D
2013-01-01  0.876253  0.494423    5.000000  0.0
2013-01-02  1.428566 -1.289029    0.061972  NaN
2013-01-03 -0.766940 -0.676397  100.000000  2.0
2013-01-04 -0.047217  1.094577   -0.802162  3.0
2013-01-05 -0.439379 -0.088270    2.289276  4.0
2013-01-06 -0.300504  0.470461    0.519427  5.0
2013-01-07 -0.552341 -0.942547    0.721599  6.0

In [52]:
df.mean(axis=0)                            #平均值，自動忽略缺失值  #skipna : boolean, default True

A     0.028348
B    -0.133826
C    15.398587
D     3.333333
dtype: float64

In [53]:
df.mean(axis=1)

2013-01-01     1.592669
2013-01-02     0.067170
2013-01-03    25.139166
2013-01-04     0.811299
2013-01-05     1.440407
2013-01-06     1.422346
2013-01-07     1.306678
Freq: D, dtype: float64

In [54]:
df.iloc[1,3]=5.0
df['D'].value_counts()           #長條圖統計

5.0    2
6.0    1
4.0    1
3.0    1
2.0    1
0.0    1
Name: D, dtype: int64

In [55]:
df.shift(periods=2,axis=0)

                   A         B           C    D
2013-01-01       NaN       NaN         NaN  NaN
2013-01-02       NaN       NaN         NaN  NaN
2013-01-03  0.876253  0.494423    5.000000  0.0
2013-01-04  1.428566 -1.289029    0.061972  5.0
2013-01-05 -0.766940 -0.676397  100.000000  2.0
2013-01-06 -0.047217  1.094577   -0.802162  3.0
2013-01-07 -0.439379 -0.088270    2.289276  4.0

In [56]:
df.shift(periods=-1,axis=1)

                   A           B    C   D
2013-01-01  0.494423    5.000000  0.0 NaN
2013-01-02 -1.289029    0.061972  5.0 NaN
2013-01-03 -0.676397  100.000000  2.0 NaN
2013-01-04  1.094577   -0.802162  3.0 NaN
2013-01-05 -0.088270    2.289276  4.0 NaN
2013-01-06  0.470461    0.519427  5.0 NaN
2013-01-07 -0.942547    0.721599  6.0 NaN

In [184]:
df4 = pd.DataFrame({'A':[np.random.randint(1,5) for i in range(8)], 
                    'B':[np.random.randint(10,15) for i in range(8)],
                    'C':[np.random.randint(20,30) for i in range(8)], 
                    'D':[np.random.randint(80,100) for i in range(8)]}
                  )
df4

   A   B   C   D
0  3  12  22  89
1  1  14  27  84
2  4  13  21  93
3  4  14  26  92
4  2  10  28  81
5  3  11  24  89
6  2  11  25  85
7  1  11  26  81

In [58]:
df4.groupby('A').sum()

    B   C    D
A
1  27  50  179
2  13  26   93
3  23  47  184
4  37  80  251

In [59]:
df4.groupby('A').mean()

           B          C          D
A
1  13.500000  25.000000  89.500000
2  13.000000  26.000000  93.000000
3  11.500000  23.500000  92.000000
4  12.333333  26.666667  83.666667

In [60]:
df4

   A   B   C   D
0  1  14  27  91
1  4  10  27  85
2  4  14  25  85
3  3  10  25  86
4  2  13  26  93
5  1  13  23  88
6  3  13  22  98
7  4  13  28  81

## 其他: 合併dataframe: pandas.concat

In [61]:
df3=df4[5:]  
df2=pd.concat([df3,df4],ignore_index=True)
df2

    A   B   C   D
0   1  13  23  88
1   3  13  22  98
2   4  13  28  81
3   1  14  27  91
4   4  10  27  85
5   4  14  25  85
6   3  10  25  86
7   2  13  26  93
8   1  13  23  88
9   3  13  22  98
10  4  13  28  81